In [1]:
import pandas as pd
import numpy as np
#%qtconsole
import platform
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
def return_file_path(base_url,file_name,file_seperator,intermediate_folder=''):
    if not intermediate_folder=='':
        intermediate_folder=intermediate_folder+file_seperator
    return '{}{}{}'.format(base_url,intermediate_folder,file_name)

In [3]:
if platform.system()=='Linux':
    base_url=r'/mnt/ECFC8291FC8255AC/Datasets/Codevita Results/'
    file_seperator='/'
else:
    file_seperator='\\'
    base_url='F:\\Datasets\\Codevita Results\\'
intermediate_folder=''

In [4]:
college_prev=pd.read_excel('./college_combined_2k15_2k16.xlsx')
college_prev=college_prev.rename(columns={'college_name_modified_normalized':'college_name_normalized',
                                          'coll_name_mod_norm_wo_common_words':'coll_name_norm_wo_common_words',
                                         'coll_name_mod_norm_wo_common_words_v2':'coll_name_norm_wo_common_words_v2'})

In [5]:
college_prev.head()

,college_name,tcs_region,mod_index,coll_name_case_independent,college_name_normalized,coll_name_norm_wo_common_words,coll_name_norm_wo_common_words_v2,master_mod_index
0,"Srm Engineering College., Kattankulathur",Chennai,2k15_0,"srm engineering college., kattankulathur",srm engineering college kattankulathur,srm kattankulathur,srm kattankulathur,2k15_0
1,"Army Institute of Technology,Pune University, ...",Pune,2k15_1,"army institute of technology,pune university, ...",army institute of technology pune university pune,army pune pune,army pune pune,2k15_1
2,"Osmania University, Hyderabad",Hyderabad,2k15_2,"osmania university, hyderabad",osmania university hyderabad,osmania hyderabad,osmania hyderabad,2k15_2
3,"Medicaps Inst of Tech & Management, Indore",Mumbai,2k15_3,"medicaps inst of tech & management, indore",medicaps inst of tech management indore,medicaps tech indore,medicaps tech indore,2k15_3
4,"Ramrao Adik Institute of Technology,Nerul",Mumbai,2k15_4,"ramrao adik institute of technology,nerul",ramrao adik institute of technology nerul,ramrao adik nerul,ramrao adik nerul,2k15_4

In [6]:
college_2k17=pd.read_csv(return_file_path(base_url,'codevita_2k17_scrapped.csv',file_seperator))

In [7]:
college_2k17.head()

,Unnamed: 0,college_name,problems_solved,round1_rank,user_name,zonal_name,zonal_rank
0,0,Dhirubhai Ambani Inst of Information & Communi...,6,1,MOHIB MANVA,zone1,1
1,1,Dhirubhai Ambani Inst of Information & Communi...,6,2,SAGAR SAVALIYA,zone1,2
2,2,"Indian Institute Of Technology, Hyderabad",6,3,VINOD DEVANABOINA,zone2,1
3,3,"School of IT, Guru Gobind Indraprastha Univ, D...",6,4,VIKRAM PANWAR,zone3,1
4,4,IIT - PATNA,5,5,GAGAN KUMAR,zone3,2

In [8]:
print(college_2k17.shape)
college_2k17.notnull().sum()

(2382, 7)

Unnamed: 0         2382
college_name       2382
problems_solved    2382
round1_rank        2382
user_name          2382
zonal_name         2382
zonal_rank         2382
dtype: int64

In [9]:
college_2k17=college_2k17.rename(columns={'zonal_name':'tcs_region'})

In [10]:
college_2k17_list=pd.DataFrame(college_2k17,columns=['college_name','tcs_region'])
college_2k17_list=college_2k17_list
college_2k17_list.college_name.unique().shape[0]

499

In [11]:
college_2k17_list=college_2k17_list.groupby('college_name',as_index=False).first()
print(college_2k17_list.shape)
college_2k17_list.head()

(499, 2)

                                        college_name tcs_region
0           A D Patel Institute of Technology, Anand      zone1
1  A Veeriya Vandayar Memorial Sri Pushpam Colleg...      zone2
2                    ABES Engineering College, Delhi      zone3
3  ABV Indian Institute of Information Technology...      zone3
4               ADITYA ENGINEERING COLLEGE, KAKINADA      zone2

In [12]:
college_2k17_list['index']=college_2k17_list.index
college_2k17_list['mod_index']=college_2k17_list['index'].apply(lambda x:'2k17_'+str(x))
college_2k17_list=college_2k17_list.drop('index',axis=1)

In [13]:
college_2k17_list.head()

                                        college_name tcs_region mod_index
0           A D Patel Institute of Technology, Anand      zone1    2k17_0
1  A Veeriya Vandayar Memorial Sri Pushpam Colleg...      zone2    2k17_1
2                    ABES Engineering College, Delhi      zone3    2k17_2
3  ABV Indian Institute of Information Technology...      zone3    2k17_3
4               ADITYA ENGINEERING COLLEGE, KAKINADA      zone2    2k17_4

Using string matching normalized to check the common entries between colleges in 2k15 and 2k16

In [14]:
from nltk.tokenize import RegexpTokenizer
tokenizer = RegexpTokenizer(r'\w+')

In [15]:
def modify_college_names_apply(x):
    return ' '.join(tokenizer.tokenize(x.lower()))
college_2k17_list['college_name_normalized']=college_2k17_list.college_name.apply(modify_college_names_apply)

In [16]:
college_2k17_list.head()

,college_name,tcs_region,mod_index,college_name_normalized
0,"A D Patel Institute of Technology, Anand",zone1,2k17_0,a d patel institute of technology anand
1,A Veeriya Vandayar Memorial Sri Pushpam Colleg...,zone2,2k17_1,a veeriya vandayar memorial sri pushpam colleg...
2,"ABES Engineering College, Delhi",zone3,2k17_2,abes engineering college delhi
3,ABV Indian Institute of Information Technology...,zone3,2k17_3,abv indian institute of information technology...
4,"ADITYA ENGINEERING COLLEGE, KAKINADA",zone2,2k17_4,aditya engineering college kakinada

In [17]:
print(college_2k17_list.shape)
college_2k17_list.notnull().sum() #Ensuring that the newly formed column doesnt have any null values

(499, 4)

college_name               499
tcs_region                 499
mod_index                  499
college_name_normalized    499
dtype: int64

In [18]:
print(sum(college_2k17_list.college_name_normalized.isin(college_prev.college_name_normalized)))
366/499*100

366

73.34669338677354

In [19]:
college_list_normalized_matches=pd.merge(college_prev,college_2k17_list,on='college_name_normalized',suffixes=('_prev','_2k17'))

In [20]:
college_list_normalized_matches.head()

,college_name_prev,tcs_region_prev,mod_index_prev,coll_name_case_independent,college_name_normalized,coll_name_norm_wo_common_words,coll_name_norm_wo_common_words_v2,master_mod_index,college_name_2k17,tcs_region_2k17,mod_index_2k17
0,"Srm Engineering College., Kattankulathur",Chennai,2k15_0,"srm engineering college., kattankulathur",srm engineering college kattankulathur,srm kattankulathur,srm kattankulathur,2k15_0,"Srm Engineering College., Kattankulathur",zone3,2k17_420
1,"Srm Engineering College., Kattankulathur",Chennai,2k16_143,"srm engineering college., kattankulathur",srm engineering college kattankulathur,srm kattankulathur,srm kattankulathur,2k15_0,"Srm Engineering College., Kattankulathur",zone3,2k17_420
2,"Army Institute of Technology,Pune University, ...",Pune,2k15_1,"army institute of technology,pune university, ...",army institute of technology pune university pune,army pune pune,army pune pune,2k15_1,"Army Institute of Technology,Pune University, ...",zone2,2k17_24
3,"Army Institute of Technology,Pune University, ...",Pune,2k16_51,"army institute of technology,pune university, ...",army institute of technology pune university pune,army pune pune,army pune pune,2k15_1,"Army Institute of Technology,Pune University, ...",zone2,2k17_24
4,"Ramrao Adik Institute of Technology,Nerul",Mumbai,2k15_4,"ramrao adik institute of technology,nerul",ramrao adik institute of technology nerul,ramrao adik nerul,ramrao adik nerul,2k15_4,"Ramrao Adik Institute of Technology,Nerul",zone3,2k17_361

In [21]:
def find(dic,index):
    return dic[index]
def union(dic,index1,index2):
    root1=find(dic,index1)
    root2=find(dic,index2)
    for key,value in dic.items():
        if value==root2:
            #print('Changed key {} from {} to {}'.format(key,value,root1))
            dic[key]=root1

In [22]:
match_dict={}
for _,row in college_prev.iterrows():
    match_dict[row['mod_index']]=row['master_mod_index']
for _,row in college_2k17_list.iterrows():
    match_dict[row['mod_index']]=row['mod_index']
len(match_dict.keys())

1732

In [23]:
for _,row in college_list_normalized_matches.iterrows():
    union(match_dict,row['mod_index_prev'],row['mod_index_2k17'])

In [24]:
match_dict['2k17_24'] #Sanity Check

'2k15_1'

In [25]:
common_words=['of','college','technology','engineering','institute','university','engg',
              'and','inst','univ','management','group','for','information','school']
def modify_college_names_wo_common_words_apply(x):
    global common_words
    words=tokenizer.tokenize(x)
    modified_words=[]
    for word in words:
        if word not in common_words:
            modified_words.append(word)
    return ' '.join(modified_words)
college_2k17_list['coll_name_norm_wo_common_words']=college_2k17_list.college_name_normalized.apply(modify_college_names_wo_common_words_apply)

In [26]:
print(sum(college_2k17_list.coll_name_norm_wo_common_words==''))
college_2k17_list[college_2k17_list.coll_name_norm_wo_common_words=='']

1

,college_name,tcs_region,mod_index,college_name_normalized,coll_name_norm_wo_common_words
206,Institute of Engineering and Management,zone3,2k17_206,institute of engineering and management,

In [27]:
college_2k17_list['coll_name_norm_wo_common_words_v2']=college_2k17_list.coll_name_norm_wo_common_words
college_2k17_list.loc[206,'coll_name_norm_wo_common_words_v2']='kolkata iem'

In [28]:
sum(college_2k17_list.coll_name_norm_wo_common_words_v2.isin(college_prev.coll_name_norm_wo_common_words_v2))

372

In [29]:
index_wo_common_words_matches=college_2k17_list[college_2k17_list.coll_name_norm_wo_common_words_v2.isin(college_prev.coll_name_norm_wo_common_words_v2)]['mod_index']
index_prev_matches_till_normalization=college_list_normalized_matches.mod_index_2k17.unique()
index_new_matches=np.setdiff1d(index_wo_common_words_matches,index_prev_matches_till_normalization)
mismatch_diff=np.setdiff1d(index_prev_matches_till_normalization,index_wo_common_words_matches)
index_new_matches

array(['2k17_190', '2k17_292', '2k17_324', '2k17_354', '2k17_378',
       '2k17_379', '2k17_386', '2k17_442', '2k17_83'], dtype=object)

In [30]:
df_new_matches_2k17=college_2k17_list[college_2k17_list.mod_index.isin(index_new_matches)]
df_new_matches_wo_common_words_join=pd.merge(df_new_matches_2k17,college_prev,on='coll_name_norm_wo_common_words_v2',suffixes=('_2k17','_prev'))
print(df_new_matches_wo_common_words_join.shape)
df_new_matches_wo_common_words_join

(11, 13)

,college_name_2k17,tcs_region_2k17,mod_index_2k17,college_name_normalized_2k17,coll_name_norm_wo_common_words_2k17,coll_name_norm_wo_common_words_v2,college_name_prev,tcs_region_prev,mod_index_prev,coll_name_case_independent,college_name_normalized_prev,coll_name_norm_wo_common_words_prev,master_mod_index
0,Darshan College,zone1,2k17_83,darshan college,darshan,darshan,DARSHAN INSTITUTE OF ENGINEERING AND TECHNOLOGY,Ahmedabad,2k16_628,darshan institute of engineering and technology,darshan institute of engineering and technology,darshan,2k16_628
1,"Indian Institute of Information Technology,",zone3,2k17_190,indian institute of information technology,indian,indian,Indian Institute of Technology,Kolkata,2k16_514,indian institute of technology,indian institute of technology,indian,2k16_514
2,Marwadi Education Foundation,zone1,2k17_292,marwadi education foundation,marwadi education foundation,marwadi education foundation,Marwadi Education Foundation Group Of Institute,Ahmedabad,2k16_645,marwadi education foundation group of institute,marwadi education foundation group of institute,marwadi education foundation,2k15_512
3,PARUL INSTITUTE OF TECHNOLOGY,zone1,2k17_324,parul institute of technology,parul,parul,Parul Institute of Engineering,Ahmedabad,2k16_315,parul institute of engineering,parul institute of engineering,parul,2k16_315
4,Rajalakshmi Engineering College,zone3,2k17_354,rajalakshmi engineering college,rajalakshmi,rajalakshmi,Rajalakshmi Engg. College,Chennai,2k15_195,rajalakshmi engg. college,rajalakshmi engg college,rajalakshmi,2k15_195
5,Rajalakshmi Engineering College,zone3,2k17_354,rajalakshmi engineering college,rajalakshmi,rajalakshmi,Rajalakshmi Engg. College,Chennai,2k16_87,rajalakshmi engg. college,rajalakshmi engg college,rajalakshmi,2k15_195
6,SRI VASAVI INSTITUTE OF ENGINEERING & TECHNOLOGY,zone2,2k17_378,sri vasavi institute of engineering technology,sri vasavi,sri vasavi,SRI VASAVI INSTITUTE OF ENGINEERING,Hyderabad,2k16_211,sri vasavi institute of engineering,sri vasavi institute of engineering,sri vasavi,2k16_211
7,SRI VASAVI INSTITUTE OF ENGINEERING AND TECHNO...,zone2,2k17_379,sri vasavi institute of engineering and techno...,sri vasavi,sri vasavi,SRI VASAVI INSTITUTE OF ENGINEERING,Hyderabad,2k16_211,sri vasavi institute of engineering,sri vasavi institute of engineering,sri vasavi,2k16_211
8,Sardar Patel Institute of Technology,zone3,2k17_386,sardar patel institute of technology,sardar patel,sardar patel,SARDAR PATEL COLLEGE OF INFORMATION TECHNOLOGY,Mumbai,2k15_236,sardar patel college of information technology,sardar patel college of information technology,sardar patel,2k15_236
9,Sardar Patel Institute of Technology,zone3,2k17_386,sardar patel institute of technology,sardar patel,sardar patel,SARDAR PATEL COLLEGE OF INFORMATION TECHNOLOGY,Mumbai,2k16_129,sardar patel college of information technology,sardar patel college of information technology,sardar patel,2k15_236
10,"University of Engineering & Management, Jaipur",zone3,2k17_442,university of engineering management jaipur,jaipur,jaipur,Jaipur Engineering College,Delhi,2k16_76,jaipur engineering college,jaipur engineering college,jaipur,2k16_76

In [31]:
df_new_matches_wo_common_words_join.to_excel('./2k17_new_matches_wo_common_words.xlsx',index=False)

In [32]:
df_new_matches_wo_common_words_matches=pd.read_excel('./2k17_new_matches_wo_common_words(copy).xlsx')
df_new_matches_wo_common_words_matches=df_new_matches_wo_common_words_matches[df_new_matches_wo_common_words_matches.match=='y']
print(df_new_matches_wo_common_words_matches.shape)
df_new_matches_wo_common_words_matches.head()

(9, 14)

,college_name_2k17,tcs_region_2k17,mod_index_2k17,college_name_normalized_2k17,coll_name_norm_wo_common_words_2k17,coll_name_norm_wo_common_words_v2,college_name_prev,tcs_region_prev,mod_index_prev,coll_name_case_independent,college_name_normalized_prev,coll_name_norm_wo_common_words_prev,master_mod_index,match
0,Darshan College,zone1,2k17_83,darshan college,darshan,darshan,DARSHAN INSTITUTE OF ENGINEERING AND TECHNOLOGY,Ahmedabad,2k16_628,darshan institute of engineering and technology,darshan institute of engineering and technology,darshan,2k16_628,y
2,Marwadi Education Foundation,zone1,2k17_292,marwadi education foundation,marwadi education foundation,marwadi education foundation,Marwadi Education Foundation Group Of Institute,Ahmedabad,2k16_645,marwadi education foundation group of institute,marwadi education foundation group of institute,marwadi education foundation,2k15_512,y
3,PARUL INSTITUTE OF TECHNOLOGY,zone1,2k17_324,parul institute of technology,parul,parul,Parul Institute of Engineering,Ahmedabad,2k16_315,parul institute of engineering,parul institute of engineering,parul,2k16_315,y
4,Rajalakshmi Engineering College,zone3,2k17_354,rajalakshmi engineering college,rajalakshmi,rajalakshmi,Rajalakshmi Engg. College,Chennai,2k15_195,rajalakshmi engg. college,rajalakshmi engg college,rajalakshmi,2k15_195,y
5,Rajalakshmi Engineering College,zone3,2k17_354,rajalakshmi engineering college,rajalakshmi,rajalakshmi,Rajalakshmi Engg. College,Chennai,2k16_87,rajalakshmi engg. college,rajalakshmi engg college,rajalakshmi,2k15_195,y

In [33]:
for _,row in df_new_matches_wo_common_words_matches.iterrows():
    union(match_dict,row['mod_index_prev'],row['mod_index_2k17'])
match_dict['2k17_83']=='2k16_628' #Sanity Check

True

In [34]:
#Doing the next step just to make the college_2k17_list fully compatible with the college_prev list
college_2k17_list['coll_name_case_independent']=college_2k17_list.college_name.apply(lambda x:x.lower())
college_2k17_list['master_mod_index']=college_2k17_list.mod_index.apply(lambda x:match_dict[x])

In [35]:
college_prev.shape

(1233, 8)

In [36]:
college_prev=college_prev.append(college_2k17_list,ignore_index=True)

In [37]:
college_prev.shape

(1732, 8)

In [38]:
college_prev.columns

Index(['coll_name_case_independent', 'coll_name_norm_wo_common_words',
       'coll_name_norm_wo_common_words_v2', 'college_name',
       'college_name_normalized', 'master_mod_index', 'mod_index',
       'tcs_region'],
      dtype='object')

In [39]:
college_prev.to_excel('./college_combined_2k15_2k16_2k17.xlsx',index=True)